Heltec-Aaron-Lee/WiFi_Kit_series/boards.txt
menu.UploadSpeed=Upload Speed
menu.USBMode=USB Mode
menu.CDCOnBoot=USB CDC On Boot
menu.MSCOnBoot=USB Firmware MSC On Boot
menu.DFUOnBoot=USB DFU On Boot
menu.UploadMode=Upload Mode
menu.CPUFreq=CPU Frequency
menu.FlashFreq=Flash Frequency
menu.FlashMode=Flash Mode
menu.FlashSize=Flash Size
menu.PartitionScheme=Partition Scheme
menu.DebugLevel=Core Debug Level
menu.PSRAM=PSRAM
menu.Revision=Board Revision
menu.LORAWAN_REGION=LoRaWan Region
menu.LoRaWanDebugLevel=LoRaWan Debug Level
menu.LoopCore=Arduino Runs On
menu.EventsCore=Events Run On
menu.MemoryType=Memory Type
menu.LORAWAN_PREAMBLE_LENGTH=LORAWAN_PREAMBLE_LENGTH
menu.LORAWAN_DebugLevel=LoRaWan Debug Level
menu.LORAWAN_DEVEUI=LORAWAN_DEVEUI
##############################################################
### DO NOT PUT BOARDS ABOVE THE OFFICIAL ESPRESSIF BOARDS! ###
##############################################################

WIFI_LoRa_32_V3.name=WiFi LoRa 32(V3) / Wireless shell(V3) / Wireless stick lite (V3)
WIFI_LoRa_32_V3.vid.0=0x303a
WIFI_LoRa_32_V3.pid.0=0x1001

WIFI_LoRa_32_V3.bootloader.tool=esptool_py
WIFI_LoRa_32_V3.bootloader.tool.default=esptool_py

WIFI_LoRa_32_V3.upload.tool=esptool_py
WIFI_LoRa_32_V3.upload.tool.default=esptool_py
WIFI_LoRa_32_V3.upload.tool.network=esp_ota

WIFI_LoRa_32_V3.upload.maximum_size=1310720
WIFI_LoRa_32_V3.upload.maximum_data_size=327680
WIFI_LoRa_32_V3.upload.flags=
WIFI_LoRa_32_V3.upload.extra_flags=
WIFI_LoRa_32_V3.upload.use_1200bps_touch=false
WIFI_LoRa_32_V3.upload.wait_for_upload_port=false

WIFI_LoRa_32_V3.serial.disableDTR=false
WIFI_LoRa_32_V3.serial.disableRTS=false

WIFI_LoRa_32_V3.build.tarch=xtensa
WIFI_LoRa_32_V3.build.bootloader_addr=0x0
WIFI_LoRa_32_V3.build.target=esp32s3
WIFI_LoRa_32_V3.build.mcu=esp32s3
WIFI_LoRa_32_V3.build.core=esp32
WIFI_LoRa_32_V3.build.variant=wifi_lora_32_v3
WIFI_LoRa_32_V3.build.board=WIFI_LORA_32_V3

WIFI_LoRa_32_V3.build.usb_mode=1
WIFI_LoRa_32_V3.build.cdc_on_boot=0
WIFI_LoRa_32_V3.build.msc_on_boot=0
WIFI_LoRa_32_V3.build.dfu_on_boot=0
WIFI_LoRa_32_V3.build.f_cpu=240000000L
WIFI_LoRa_32_V3.build.flash_size=8MB
WIFI_LoRa_32_V3.build.flash_freq=80m
WIFI_LoRa_32_V3.build.flash_mode=dio
WIFI_LoRa_32_V3.build.boot=qio
WIFI_LoRa_32_V3.build.boot_freq=80m
WIFI_LoRa_32_V3.build.partitions=default_8MB
WIFI_LoRa_32_V3.build.loop_core=
WIFI_LoRa_32_V3.build.event_core=
WIFI_LoRa_32_V3.build.psram_type=qspi
WIFI_LoRa_32_V3.build.memory_type={build.boot}_{build.psram_type}

WIFI_LoRa_32_V3.menu.LoopCore.1=Core 1
WIFI_LoRa_32_V3.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
WIFI_LoRa_32_V3.menu.LoopCore.0=Core 0
WIFI_LoRa_32_V3.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

WIFI_LoRa_32_V3.menu.EventsCore.1=Core 1
WIFI_LoRa_32_V3.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
WIFI_LoRa_32_V3.menu.EventsCore.0=Core 0
WIFI_LoRa_32_V3.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

WIFI_LoRa_32_V3.menu.CPUFreq.240=240MHz (WiFi)
WIFI_LoRa_32_V3.menu.CPUFreq.240.build.f_cpu=240000000L
WIFI_LoRa_32_V3.menu.CPUFreq.160=160MHz (WiFi)
WIFI_LoRa_32_V3.menu.CPUFreq.160.build.f_cpu=160000000L
WIFI_LoRa_32_V3.menu.CPUFreq.80=80MHz (WiFi)
WIFI_LoRa_32_V3.menu.CPUFreq.80.build.f_cpu=80000000L
WIFI_LoRa_32_V3.menu.CPUFreq.40=40MHz
WIFI_LoRa_32_V3.menu.CPUFreq.40.build.f_cpu=40000000L
WIFI_LoRa_32_V3.menu.CPUFreq.20=20MHz
WIFI_LoRa_32_V3.menu.CPUFreq.20.build.f_cpu=20000000L
WIFI_LoRa_32_V3.menu.CPUFreq.10=10MHz
WIFI_LoRa_32_V3.menu.CPUFreq.10.build.f_cpu=10000000L

WIFI_LoRa_32_V3.menu.UploadSpeed.921600=921600
WIFI_LoRa_32_V3.menu.UploadSpeed.921600.upload.speed=921600
WIFI_LoRa_32_V3.menu.UploadSpeed.115200=115200
WIFI_LoRa_32_V3.menu.UploadSpeed.115200.upload.speed=115200
WIFI_LoRa_32_V3.menu.UploadSpeed.256000.windows=256000
WIFI_LoRa_32_V3.menu.UploadSpeed.256000.upload.speed=256000
WIFI_LoRa_32_V3.menu.UploadSpeed.230400.windows.upload.speed=256000
WIFI_LoRa_32_V3.menu.UploadSpeed.230400=230400
WIFI_LoRa_32_V3.menu.UploadSpeed.230400.upload.speed=230400
WIFI_LoRa_32_V3.menu.UploadSpeed.460800.linux=460800
WIFI_LoRa_32_V3.menu.UploadSpeed.460800.macosx=460800
WIFI_LoRa_32_V3.menu.UploadSpeed.460800.upload.speed=460800
WIFI_LoRa_32_V3.menu.UploadSpeed.512000.windows=512000
WIFI_LoRa_32_V3.menu.UploadSpeed.512000.upload.speed=512000

WIFI_LoRa_32_V3.menu.DebugLevel.none=None
WIFI_LoRa_32_V3.menu.DebugLevel.none.build.code_debug=0
WIFI_LoRa_32_V3.menu.DebugLevel.error=Error
WIFI_LoRa_32_V3.menu.DebugLevel.error.build.code_debug=1
WIFI_LoRa_32_V3.menu.DebugLevel.warn=Warn
WIFI_LoRa_32_V3.menu.DebugLevel.warn.build.code_debug=2
WIFI_LoRa_32_V3.menu.DebugLevel.info=Info
WIFI_LoRa_32_V3.menu.DebugLevel.info.build.code_debug=3
WIFI_LoRa_32_V3.menu.DebugLevel.debug=Debug
WIFI_LoRa_32_V3.menu.DebugLevel.debug.build.code_debug=4
WIFI_LoRa_32_V3.menu.DebugLevel.verbose=Verbose
WIFI_LoRa_32_V3.menu.DebugLevel.verbose.build.code_debug=5

WIFI_LoRa_32_V3.menu.LORAWAN_REGION.0=REGION_EU868
WIFI_LoRa_32_V3.menu.LORAWAN_REGION.0.build.band=REGION_EU868
WIFI_LoRa_32_V3.menu.LORAWAN_REGION.1=REGION_EU433
WIFI_LoRa_32_V3.menu.LORAWAN_REGION.1.build.band=REGION_EU433
WIFI_LoRa_32_V3.menu.LORAWAN_REGION.2=REGION_CN470
WIFI_LoRa_32_V3.menu.LORAWAN_REGION.2.build.band=REGION_CN470
WIFI_LoRa_32_V3.menu.LORAWAN_REGION.3=REGION_US915
WIFI_LoRa_32_V3.menu.LORAWAN_REGION.3.build.band=REGION_US915
WIFI_LoRa_32_V3.menu.LORAWAN_REGION.4=REGION_AU915
WIFI_LoRa_32_V3.menu.LORAWAN_REGION.4.build.band=REGION_AU915
WIFI_LoRa_32_V3.menu.LORAWAN_REGION.5=REGION_CN779
WIFI_LoRa_32_V3.menu.LORAWAN_REGION.5.build.band=REGION_CN779
WIFI_LoRa_32_V3.menu.LORAWAN_REGION.6=REGION_AS923
WIFI_LoRa_32_V3.menu.LORAWAN_REGION.6.build.band=REGION_AS923
WIFI_LoRa_32_V3.menu.LORAWAN_REGION.7=REGION_KR920
WIFI_LoRa_32_V3.menu.LORAWAN_REGION.7.build.band=REGION_KR920
WIFI_LoRa_32_V3.menu.LORAWAN_REGION.8=REGION_IN865
WIFI_LoRa_32_V3.menu.LORAWAN_REGION.8.build.band=REGION_IN865
WIFI_LoRa_32_V3.menu.LORAWAN_REGION.9=REGION_US915_HYBRID
WIFI_LoRa_32_V3.menu.LORAWAN_REGION.9.build.band=REGION_US915_HYBRID

WIFI_LoRa_32_V3.menu.LoRaWanDebugLevel.0=None
WIFI_LoRa_32_V3.menu.LoRaWanDebugLevel.0.build.LoRaWanDebugLevel=0
WIFI_LoRa_32_V3.menu.LoRaWanDebugLevel.1=Freq
WIFI_LoRa_32_V3.menu.LoRaWanDebugLevel.1.build.LoRaWanDebugLevel=1
WIFI_LoRa_32_V3.menu.LoRaWanDebugLevel.2=Freq && DIO
WIFI_LoRa_32_V3.menu.LoRaWanDebugLevel.2.build.LoRaWanDebugLevel=2
WIFI_LoRa_32_V3.menu.LoRaWanDebugLevel.3=Freq && DIO && PW
WIFI_LoRa_32_V3.menu.LoRaWanDebugLevel.3.build.LoRaWanDebugLevel=3

